# Challenge 2

## A different approach

Challenge 2 required us to merge two data files together and then export them to a database. As many of you may have discovered, this was quite challenging and required a lot of manipulation and large SQL statements written as strings in Python.

Fortunately for us, a lot of people use Python and some of them are very smart. One of the best things about Python is that you can really easily use those smart people's code yourself. We already did this when we imported pyodbc in Challenge 2:

In [2]:
import pyodbc

In Python, imported code like pyodbc is called a module. There are thousands of modules available; there is almost always an import that will make your life way easier.

For challenge 2, there is a very widely used module called pandas that does exactly what we need. More info on pandas can be found in the documentation here: https://pandas.pydata.org/pandas-docs

In [16]:
import pandas as pd

file1 = r'C:\DataAnalystData\Challenge_2.1\UFOGB_Details.csv'
file2 = r'C:\DataAnalystData\Challenge_2.1\UFOGB_Comments.csv'
merged_file = r'C:\DataAnalystData\Challenge_2.1\UFOGB_Observations2.csv'

headers_details = ["id", "date_time", "city", "state", "UFO_shape", "duration", "date_posted"] 
headers_comments =["id","comment"]


df1 = pd.read_csv(file1, header=None, names = headers_details)
df2 = pd.read_csv(file2, header=None, names = headers_comments)

df1.head()

,id,date_time,city,state,UFO_shape,duration,date_posted
0,244,01/01/1978 00:00,london (uk/englnd),gb,disk,1.0,06/12/2008
1,245,01/01/1982 17:00,newcastle (uk/england),gb,cylinder,30.0,3/21/2003
2,246,01/01/2002 13:00,torquay (outside of) (uk/england),gb,sphere,30.0,5/24/2005
3,247,01/01/2002 22:00,sheffield (south yorkshire) (uk/england),gb,sphere,20.0,12/14/2006
4,248,01/01/2003 00:05,grimsby (uk/england),gb,light,60.0,03/04/2003

Let's breakdown the code above. The first line imports the pandas module. It adds 'as pd' to allow us to refer to pandas using the letters 'pd' rather than typing out 'pandas' every time.

The rest of the code imports the two csv files. As you can see, pandas provides a function (pd.read_csv) that allows you to just import the csv. No fuss, no mess, just use the function. As our files don't have headers I have also added these using lists.

Pandas turns the csv files into dataframes. Dataframes are a special data type created by pandas. They are very fast and easy to use; as you can see from the output, they look a lot like a SQL table. The df1.head() function prints the first 5 rows of the table so we can see what it looks like.

Let's now complete the rest of Challenge 2.

In [19]:
merged_df = df1.merge(df2, on="id", sort = True)
merged_df.to_csv(merged_file, index = False)


merged_df.head()

,id,date_time,city,state,UFO_shape,duration,date_posted,comment
0,1,10/16/2002 15:00,glasgow (uk/scotland),gb,other,300.0,10/28/2002,I am a Buyer with Scottish Water working in Gl...
1,2,10/16/2004 00:10,northampton (uk/england),gb,light,1800.0,4/27/2007,Disco Lights over Northampton&#44 UK.
2,3,10/16/2007 19:55,leeds (uk/england),gb,fireball,300.0,11/28/2007,Golden light ball / craft in the sky
3,4,10/16/2009 19:30,selby (uk/england),gb,changing,240.0,12/12/2009,A orange splatter shaped light hovering in one...
4,5,10/17/2007 20:15,leeds (west yorkshire) (uk/england),gb,triangle,15.0,03/04/2008,((HOAX??)) i look up at the stars when i saw ...

Merging the files together is just one function - unsurprisingly called merge! No messing around with lists, sorting or anything.

Writing the file to a new csv is similarly one function - to_csv. This handles everything for you too. But what about getting the data into a database?

In [18]:
from sqlalchemy import create_engine
import urllib

#create database connection
params = urllib.parse.quote_plus(r'DRIVER={ODBC Driver 13 for SQL Server};'r'SERVER=TFAHY-PC\SQLExpress;'r'DATABASE=UFOData;'r'Trusted_Connection=yes')

engine = create_engine("mssql+pyodbc:///?odbc_connect={}".format(params))

#create table 'UFO' and send dataframe to that table
merged_df.to_sql('UFO', con=engine)

The above might look a little scary, but its essentially exactly the same as using pyodbc in Challenge 2 Part 2. The main difference is that we are using another imported module called 'sqlalchemy'.

SQL Alchemy is another extremely popular module that allows you to connect to a database and query that database, <i> without using any SQL at all. </i> Only Python needs to be used - hopefully from part 2 of the challenge you can see why this is very useful. The reason we use it here is that pandas only accepts a sqlalchemy connection.

The params variable uses another module, urllib, to make sure sqlalchemy understands the database connection in the same format as that used in the challenge (r'DRIVER={ODBC Driver 13 for SQL Server}; etc). Look <a href='https://docs.sqlalchemy.org/en/13/core/engines.html'>  here </a> if you are unsure how to connect to your own database using SQLAlchemy.

Once the connection is established, one line accomplishes the whole of Part 2. The to_sql pandas function creates the table, creates the columns and adds the data. No messing around with SQL strings and lists.

<br>

For those who made it to the end, I hope this is a useful demonstration of pandas and helps you understand that Python can in fact be very easy so long as you use the right module. If you are unsure, the best way is to google what you want to do and add the word 'Python module' to the end. The first webpage will almost certainly give you the right module to use.